---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetReportsFolderParsed
source: html/e657929e-c094-0b2b-a19f-e19538ef4378.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetReportsFolderParsed Method

Gets the absolute reports folder path that is parsed from the original input.

## Syntax (C#)
```csharp
public string GetReportsFolderParsed()
```

## Returns
The reports folder path after parsing the input string.